Repository: MyUser740/Minecraft-Server
Catalog: Minecraft-Server/App_LocalResources/Home.*.resx
Languages: es_es, fil_ph, id_id, km_kh, ms_my, th_th, vi_vn, zh_cn, zh_hant

# title_ServerAdvantages
source: Our Minecraft Server Advantages
es_es: Nuestras ventajas del servidor Minecraft
fil_ph: Ang aming Mga kalamangan sa Minecraft Server
id_id: Keunggulan Server Minecraft kami
km_kh: គុណសម្បត្តិម៉ាស៊ីនរ៉ែ Minecraft របស់យើង
ms_my: Kelebihan Server Minecraft kami
th_th: ข้อดีของ Minecraft Server ของเรา
vi_vn: Ưu điểm Minecraft Server của chúng tôi
zh_cn: 我们的Minecraft服务器优势
zh_hant: 我們的Minecraft服務器優勢

# adv_1
source: High speed server
es_es: Servidor de alta velocidad
fil_ph: Mataas na bilis ng server
id_id: Server berkecepatan tinggi
km_kh: ម៉ាស៊ីនមេមានល្បឿនលឿន
ms_my: Pelayan berkelajuan tinggi
th_th: เซิร์ฟเวอร์ความเร็วสูง
vi_vn: Máy chủ tốc độ cao
zh_cn: 高速服务器
zh_hant: 高速服務器

# adv_2
source: Privacy
es_es: Intimidad
id_id: Privasi
km_kh: ភាពឯកជន
ms_my: Privasi
th_th: ความเป็นส่วนตัว
vi_vn: Riêng tư
zh_cn: 隐私
zh_hant: 隱私

# adv_3
source: Best Community
es_es: Mejor comunidad
fil_ph: Pinakamahusay na Komunidad
id_id: Komunitas Terbaik
km_kh: សហគមន៍ល្អបំផុត
ms_my: Komuniti Terbaik
th_th: ชุมชนที่ดีที่สุด
vi_vn: Cộng đồng tốt nhất
zh_cn: 最佳社区
zh_hant: 最佳社區

# adv_4
source: Hosted 24/7
es_es: Alojado 24/7
fil_ph: Nag-host ng 24/7
id_id: Di-host 24/7
km_kh: បានរៀបចំ ២៤/៧
ms_my: Dihoskan 24/7
th_th: โฮสต์ 24/7
vi_vn: Lưu trữ 24/7
zh_cn: 托管24/7
zh_hant: 託管24/7

# gamemode_Title
source: Gamemode
es_es: Modo de juego
id_id: Mode Permainan
km_kh: របៀបលេងហ្គេម
ms_my: Mod permainan
th_th: โหมดเกม
vi_vn: Chế độ chơi
zh_cn: 游戏模式
zh_hant: 遊戲模式

# gamemode_Subtitle
source: Available gamemode in our minecraft Server
es_es: Mod permainan yang tersedia di pelayan minecraft kami
fil_ph: Magagamit na mode ng laro sa aming minecraft Server
id_id: Mode permainan yang tersedia di Server minecraft kami
km_kh: របៀបលេងហ្គេមដែលអាចរកបាននៅក្នុង Server Minecraft របស់យើង
ms_my: Mod permainan yang tersedia di pelayan minecraft kami
th_th: โหมดเกมที่มีอยู่ในเซิร์ฟเวอร์ minecraft ของเรา
vi_vn: Chế độ chơi có sẵn trong Máy chủ minecraft của chúng tôi
zh_cn: 我们的世界服务器中可用的游戏模式
zh_hant: 我们的世界服務器中可用的遊戲模式

# gamode_surv_section
source: Survival
es_es: Supervivencia
fil_ph: Kaligtasan ng buhay
id_id: Bertahan Hidup
km_kh: ការរស់រានមានជីវិត
ms_my: Kelangsungan hidup
th_th: การอยู่รอด
vi_vn: Sự sống còn
zh_cn: 生存
zh_hant: 生存

# gamemode_surv_content
source: Survival mode is one of the main game modes in Minecraft. Players must collect resources, build structures, battle mobs, eat, and explore the world in an effort to thrive and survive. In Bedrock Edition, players may receive achievements in a world not set to Flat while playing Survival Mode with cheats off, add-ons off, and host privileges off. If a player creates a world in creative mode and then loads it in Survival Mode, the player cannot earn achievements in that world. In Minecraft Survival, the main goal is to survive, build, explore, and have fun, but also an optional goal in Survival is to defeat the Ender Dragon and the Wither. In Survival, players have an inventory to collect items. All Blocks require a certain amount of time to break unlike Creative mode where you can instantly destroy blocks. These items can be used in recipes to create tools including (Pickaxe, Axe, Sword, Hoe, Shovel) and other items. The recipes can also be accessed easier by clicking the Recipe book in the bottom left corner. This process is known as crafting. Most crafting recipes require a crafting table. Some items cannot be obtained by crafting normally and require a furnace for processing. Various other crafting stations exist for other uses, such as brewing, repairing, and enchanting. In Survival mode, the player is able to receive damage from the environment (fall damage, suffocation, and lava) and from hostile mobs (unless playing on peaceful, where hostile mobs are disabled). A player who receives enough damage dies and returns to a spawn point. If cheats are enabled, a player can switch to Survival mode by using the command /gamemode survival but cannot earn achievements.
es_es: El modo de supervivencia es uno de los principales modos de juego de Minecraft. Los jugadores deben recolectar recursos, construir estructuras, luchar contra turbas, comer y explorar el mundo en un esfuerzo por prosperar y sobrevivir. En Bedrock Edition, los jugadores pueden recibir logros en un mundo que no esté configurado en Flat mientras juegan en el modo de supervivencia sin trampas, complementos y privilegios de anfitrión desactivados. Si un jugador crea un mundo en modo creativo y luego lo carga en modo de supervivencia, el jugador no puede ganar logros en ese mundo. En Minecraft Survival, el objetivo principal es sobrevivir, construir, explorar y divertirse, pero también un objetivo opcional en Survival es derrotar al Ender Dragon y Wither. En Survival, los jugadores tienen un inventario para recolectar artículos. Todos los bloques requieren una cierta cantidad de tiempo para romperse, a diferencia del modo creativo, donde puedes destruir bloques instantáneamente. Estos elementos se pueden utilizar en recetas para crear herramientas que incluyen (pico, hacha, espada, azada, pala) y otros elementos. También se puede acceder más fácilmente a las recetas haciendo clic en el Libro de recetas en la esquina inferior izquierda. Este proceso se conoce como elaboración. La mayoría de las recetas de elaboración requieren una mesa de elaboración. Algunos artículos no se pueden obtener elaborando normalmente y requieren un horno para su procesamiento. Existen varias otras estaciones de elaboración para otros usos, como elaboración de cerveza, reparación y encantamiento. En el modo Supervivencia, el jugador puede recibir daño del entorno (daño por caída, asfixia y lava) y de turbas hostiles (a menos que juegue en modo pacífico, donde las turbas hostiles están desactivadas). Un jugador que recibe suficiente daño muere y regresa a un punto de generación. Si los trucos están habilitados, un jugador puede cambiar al modo Supervivencia utilizando el comando / modo de juego Supervivencia, pero no puede obtener logros.
fil_ph: Ang mode na kaligtasan ng buhay ay isa sa mga pangunahing mode ng laro sa Minecraft. Dapat kolektahin ng mga manlalaro ang mga mapagkukunan, bumuo ng mga istraktura, labanan ang mga mandurumog, kumain, at tuklasin ang mundo sa pagsisikap na umunlad at mabuhay. Sa Bedrock Edition, ang mga manlalaro ay maaaring makatanggap ng mga nakamit sa isang mundo na hindi nakatakda sa Flat habang naglalaro ng Survival Mode na may mga cheats off, mga add-on, at off ang mga pribilehiyo. Kung ang isang manlalaro ay lumilikha ng isang mundo sa mode na malikha at mai-load ito sa Survival Mode, ang manlalaro ay hindi maaaring makakuha ng mga nakamit sa mundong iyon. Sa Minecraft Survival, ang pangunahing layunin ay upang mabuhay, bumuo, mag-explore, at magsaya, ngunit isang opsyonal na layunin din sa Survival ay talunin ang Ender Dragon at the Wither. Sa Kaligtasan ng buhay, ang mga manlalaro ay mayroong imbentaryo upang mangolekta ng mga item. Ang lahat ng mga Block ay nangangailangan ng isang tiyak na dami ng oras upang masira hindi katulad ng Creative mode kung saan maaari mong agad na sirain ang mga bloke. Ang mga item na ito ay maaaring magamit sa mga recipe upang lumikha ng mga tool kabilang ang (Pickaxe, Axe, Sword, Hoe, Shovel) at iba pang mga item. Maaari ding ma-access nang mas madali ang mga recipe sa pamamagitan ng pag-click sa libro ng Recipe sa ibabang kaliwang sulok. Ang prosesong ito ay kilala bilang crafting. Karamihan sa mga resipe ng crafting ay nangangailangan ng isang crafting table. Ang ilang mga item ay hindi maaaring makuha sa pamamagitan ng crafting nang normal at nangangailangan ng isang pugon para sa pagproseso. Iba't ibang iba pang mga istasyon ng crafting ang mayroon para sa iba pang mga paggamit, tulad ng paggawa ng serbesa, pag-aayos, at pag-akit. Sa Survival mode, ang manlalaro ay makakatanggap ng pinsala mula sa kapaligiran (pinsala sa taglagas, inis, at lava) at mula sa pagalit na mga manggugulo (maliban kung naglalaro sa mapayapang, kung saan hindi pinagana ang mga manggugalit na mob) Ang isang manlalaro na tumatanggap ng sapat na pinsala ay namatay at bumalik sa isang spawn point. Kung pinagana ang mga cheat, ang isang manlalaro ay maaaring lumipat sa Survival mode sa pamamagitan ng paggamit ng command / gamemode survival ngunit hindi makakakuha ng mga nakamit.
id_id: Mode bertahan hidup adalah salah satu mode permainan utama di Minecraft. Pemain harus mengumpulkan sumber daya, membangun struktur, melawan monster, makan, dan menjelajahi dunia dalam upaya untuk berkembang dan bertahan hidup. Dalam Edisi Bedrock, pemain dapat menerima pencapaian di dunia yang tidak disetel ke Datar saat memainkan Mode Bertahan Hidup dengan menonaktifkan cheat, add-on, dan hak istimewa host dinonaktifkan. Jika seorang pemain menciptakan dunia dalam mode kreatif dan kemudian memuatnya dalam Mode Bertahan, pemain tidak dapat memperoleh pencapaian di dunia itu. Dalam Minecraft Survival, tujuan utamanya adalah untuk bertahan hidup, membangun, menjelajah, dan bersenang-senang, tetapi tujuan opsional dalam Survival adalah mengalahkan Ender Dragon dan Wither. Dalam Survival, pemain memiliki inventaris untuk mengumpulkan item. Semua Blok membutuhkan jumlah waktu tertentu untuk dipecahkan tidak seperti mode Kreatif di mana Anda dapat langsung menghancurkan blok. Item ini dapat digunakan dalam resep untuk membuat alat termasuk (Beliung, Kapak, Pedang, Cangkul, Sekop) dan item lainnya. Resep-resepnya juga bisa diakses lebih mudah dengan mengklik buku Resep di pojok kiri bawah. Proses ini dikenal sebagai crafting. Sebagian besar resep kerajinan membutuhkan meja kerajinan. Beberapa item tidak dapat diperoleh dengan kerajinan normal dan membutuhkan tungku untuk diproses. Berbagai stasiun kerajinan lain ada untuk kegunaan lain, seperti pembuatan bir, perbaikan, dan mempesona. Dalam mode Survival, pemain dapat menerima kerusakan dari lingkungan (kerusakan akibat jatuh, mati lemas, dan lava) dan dari massa yang bermusuhan (kecuali bermain dengan damai, di mana massa yang bermusuhan dinonaktifkan). Seorang pemain yang menerima cukup kerusakan mati dan kembali ke titik spawn. Jika cheat diaktifkan, pemain dapat beralih ke mode Survival dengan menggunakan survival command / gamemode tetapi tidak dapat memperoleh pencapaian.
km_kh: របៀបរស់រានមានជីវិតគឺជារបៀបលេងហ្គេមដ៏សំខាន់មួយនៅក្នុង Minecraft ។ អ្នកលេងត្រូវតែប្រមូលធនធានបង្កើតរចនាសម្ព័ន្ធក្រុមប្រយុទ្ធប្រយុទ្ធបរិភោគនិងរុករកពិភពលោកក្នុងការខិតខំដើម្បីរស់និងរស់។ នៅក្នុង Bedrock Edition អ្នកលេងអាចនឹងទទួលបានសមិទ្ធិផលនៅក្នុងពិភពលោកដែលមិនត្រូវបានកំណត់នៅពេលដែលលេងរបៀបរស់រានមានជីវិតជាមួយនឹងការបន្លំបិទកម្មវិធីបន្ថែមនិងសិទ្ធិបិទម៉ាស៊ីន។ ប្រសិនបើអ្នកលេងបង្កើតពិភពលោកក្នុងរបៀបច្នៃប្រឌិតហើយបន្ទាប់មកផ្ទុកវានៅក្នុងរបៀបរស់រានមានជីវិតអ្នកលេងមិនអាចទទួលបានសមិទ្ធិផលនៅក្នុងពិភពលោកនោះទេ។ នៅក្នុងការរុករក Minecraft ការរស់រានមានជីវិតគោលដៅសំខាន់គឺដើម្បីរស់នៅកសាងការរុករកនិងមានភាពសប្បាយរីករាយប៉ុន្តែក៏ជាគោលដៅជម្រើសមួយនៅក្នុងការរស់រានមានជីវិតគឺដើម្បីកម្ចាត់អេនឌ័រនាគនិងស្វិត។ នៅក្នុងការរស់រានមានជីវិតអ្នកលេងមានសារពើភ័ណ្ឌដើម្បីប្រមូលរបស់របរ។ ប្លុកទាំងអស់ត្រូវការពេលវេលាជាក់លាក់ដើម្បីបំបែកមិនដូចរបៀបច្នៃប្រឌិតដែលអ្នកអាចបំផ្លាញប្លុកភ្លាមៗ។ ធាតុទាំងនេះអាចត្រូវបានប្រើនៅក្នុងរូបមន្តដើម្បីបង្កើតឧបករណ៍រួមមាន (Pickaxe, Ax, ដាវ, Hoe, Shovel) និងរបស់ផ្សេងទៀត។ រូបមន្តធ្វើម្ហូបក៏អាចចូលបានកាន់តែងាយស្រួលដោយចុចសៀវភៅរូបមន្តនៅជ្រុងខាងឆ្វេងផ្នែកខាងក្រោម។ ដំណើរការនេះត្រូវបានគេស្គាល់ថាជាសិប្បកម្ម។ រូបមន្តធ្វើសិប្បកម្មភាគច្រើនតម្រូវឱ្យមានតុធ្វើនំ។ របស់របរខ្លះមិនអាចទទួលបានដោយសិប្បកម្មធម្មតាទេហើយត្រូវការឡសម្រាប់ដំណើរការ។ ស្ថានីយ៍សិប្បកម្មផ្សេងៗមានសម្រាប់ការប្រើប្រាស់ផ្សេងទៀតដូចជាស្រាបៀរជួសជុលនិងវាងវៃ។ នៅក្នុងរបៀបរស់រានមានជីវិតអ្នកលេងអាចទទួលបានការខូចខាតពីបរិស្ថាន (ការដួលរលំការថប់ដង្ហើមនិងកង្ហារ) និងពីក្រុមអរិភាព (លើកលែងតែលេងដោយសន្តិវិធីដែលក្រុមអរិភាពត្រូវបានបិទ) ។ អ្នកលេងដែលទទួលបានការខូចខាតគ្រប់គ្រាន់ស្លាប់ហើយត្រលប់ទៅកន្លែងពងកូនវិញ។ ប្រសិនបើការបន្លំត្រូវបានបើកអ្នកលេងអាចប្តូរទៅរបៀបរស់រានមានជីវិតដោយប្រើពាក្យបញ្ជា / ការរំជើបរំជួល gamemode ប៉ុន្តែមិនអាចរកបានសមិទ្ធិផល។
ms_my: Survival mode adalah salah satu mod permainan utama di Minecraft. Pemain mesti mengumpulkan sumber daya, membina struktur, memerangi massa, makan, dan menjelajah dunia dalam usaha untuk berkembang maju dan bertahan. Dalam Edisi Bedrock, pemain mungkin mendapat pencapaian dalam dunia yang tidak ditetapkan ke Flat ketika bermain Survival Mode dengan cheat off, add-ons, dan host host off. Sekiranya pemain mencipta dunia dalam mod kreatif dan kemudian memuatkannya dalam Survival Mode, pemain tidak dapat memperoleh pencapaian di dunia itu. Dalam Minecraft Survival, tujuan utamanya adalah bertahan, membina, menjelajah, dan bersenang-senang, tetapi juga tujuan pilihan dalam Survival adalah untuk mengalahkan Ender Dragon dan the Wither. Dalam Survival, pemain mempunyai inventori untuk mengumpulkan barang. Semua Blok memerlukan sejumlah masa untuk berhenti seperti mod Kreatif di mana anda boleh menghancurkan blok dengan serta-merta. Barang-barang ini boleh digunakan dalam resipi untuk membuat alat termasuk (beliung, kapak, pedang, cangkul, sekop) dan barang-barang lain. Resipi juga boleh diakses dengan lebih mudah dengan mengklik buku Resipi di sudut kiri bawah. Proses ini dikenali sebagai kerajinan. Sebilangan besar resipi membuat kraftangan. Sebilangan barang tidak dapat diperoleh dengan membuat secara normal dan memerlukan tungku untuk diproses. Pelbagai stesen pembuatan lain ada untuk kegunaan lain, seperti pembuatan bir, pembaikan, dan mempesona. Dalam mod Survival, pemain dapat menerima kerosakan dari persekitaran (kerosakan jatuh, sesak nafas, dan lava) dan dari kumpulan bermusuhan (kecuali bermain dengan aman, di mana kumpulan bermusuhan dilumpuhkan). Seorang pemain yang mendapat kerosakan yang cukup mati dan kembali ke titik pemijahan. Sekiranya cheat diaktifkan, pemain boleh beralih ke mod Survival dengan menggunakan survival / gamemode perintah tetapi tidak dapat memperoleh pencapaian.
th_th: โหมดเอาชีวิตรอดเป็นหนึ่งในโหมดเกมหลักในมายคราฟ ผู้เล่นจะต้องรวบรวมทรัพยากรสร้างโครงสร้างต่อสู้กับฝูงชนกินและสำรวจโลกด้วยความพยายามที่จะเติบโตและอยู่รอด ใน Bedrock Edition ผู้เล่นอาจได้รับความสำเร็จในโลกที่ไม่ได้ตั้งค่าเป็น Flat ในขณะที่เล่น Survival Mode โดยปิดกลโกงปิดโปรแกรมเสริมและปิดสิทธิ์ของโฮสต์ หากผู้เล่นสร้างโลกในโหมดสร้างสรรค์แล้วโหลดในโหมดเอาชีวิตรอดผู้เล่นจะไม่สามารถรับรางวัลพิเศษในโลกนั้นได้ ใน Minecraft Survival เป้าหมายหลักคือเอาชีวิตรอดสร้างสำรวจและสนุกสนาน แต่เป้าหมายเสริมใน Survival คือการเอาชนะ Ender Dragon และ Wither ใน Survival ผู้เล่นจะมีสินค้าคงคลังเพื่อรวบรวมไอเท็ม บล็อกทั้งหมดต้องใช้เวลาระยะหนึ่งในการทำลายซึ่งแตกต่างจากโหมดสร้างสรรค์ที่คุณสามารถทำลายบล็อกได้ทันที ไอเท็มเหล่านี้สามารถใช้ในสูตรอาหารเพื่อสร้างเครื่องมือต่างๆ ได้แก่ (Pickaxe, Axe, Sword, Hoe, Shovel) และไอเท็มอื่น ๆ นอกจากนี้ยังสามารถเข้าถึงสูตรอาหารได้ง่ายขึ้นโดยคลิกที่หนังสือสูตรอาหารที่มุมล่างซ้าย กระบวนการนี้เรียกว่างานหัตถกรรม สูตรการประดิษฐ์ส่วนใหญ่ต้องใช้โต๊ะคราฟต์ บางรายการไม่สามารถหาได้จากการประดิษฐ์ตามปกติและต้องใช้เตาเผาเพื่อแปรรูป มีสถานีการประดิษฐ์อื่น ๆ อีกมากมายสำหรับการใช้งานอื่น ๆ เช่นการต้มเบียร์การซ่อมแซมและการสร้างเสน่ห์ ในโหมดเอาชีวิตรอดผู้เล่นจะได้รับความเสียหายจากสภาพแวดล้อม (ความเสียหายจากการตกการหายใจไม่ออกและลาวา) และจากฝูงชนที่ไม่เป็นมิตร (เว้นแต่จะเล่นแบบสงบที่ซึ่งม็อบศัตรูจะถูกปิดใช้งาน) ผู้เล่นที่ได้รับความเสียหายเพียงพอจะตายและกลับไปที่จุดเกิด หากเปิดใช้กลโกงผู้เล่นสามารถเปลี่ยนเป็นโหมดเอาชีวิตรอดได้โดยใช้คำสั่ง / โหมดการอยู่รอด แต่ไม่สามารถรับรางวัลพิเศษได้
vi_vn: Chế độ sinh tồn là một trong những chế độ chơi chính trong Minecraft. Người chơi phải thu thập tài nguyên, xây dựng công trình, chiến đấu với mob, ăn uống và khám phá thế giới để cố gắng phát triển và tồn tại. Trong Bedrock Edition, người chơi có thể nhận được thành tích trong một thế giới không được đặt ở chế độ Bằng phẳng khi chơi Chế độ sinh tồn khi tắt gian lận, tắt tiện ích và đặc quyền máy chủ. Nếu người chơi tạo ra một thế giới trong chế độ sáng tạo và sau đó tải nó trong Chế độ sinh tồn, người chơi không thể kiếm được thành tựu trong thế giới đó. Trong Minecraft Survival, mục tiêu chính là sống sót, xây dựng, khám phá và vui chơi, nhưng cũng có một mục tiêu không bắt buộc trong Survival là đánh bại Ender Dragon và Wither. Trong Survival, người chơi có một kho đồ để thu thập các vật phẩm. Tất cả các Khối yêu cầu một khoảng thời gian nhất định để phá vỡ không giống như chế độ Sáng tạo, nơi bạn có thể phá hủy các khối ngay lập tức. Những vật phẩm này có thể được sử dụng trong công thức nấu ăn để tạo ra các công cụ bao gồm (Cuốc, Rìu, Kiếm, Cuốc, Xẻng) và các vật phẩm khác. Bạn cũng có thể truy cập công thức nấu ăn dễ dàng hơn bằng cách nhấp vào sách Công thức nấu ăn ở góc dưới cùng bên trái. Quá trình này được gọi là thủ công. Hầu hết các công thức chế tạo đều yêu cầu bàn chế tạo. Một số vật phẩm không thể kiếm được bằng cách chế tạo thông thường và cần phải có lò để xử lý. Nhiều trạm chế tác khác tồn tại cho các mục đích sử dụng khác, chẳng hạn như sản xuất bia, sửa chữa và làm mê hoặc. Trong chế độ Sinh tồn, người chơi có thể nhận sát thương từ môi trường (thiệt hại do rơi, ngạt thở và dung nham) và từ mob thù địch (trừ khi chơi trên hòa bình, nơi mob thù địch bị vô hiệu hóa). Người chơi nhận đủ sát thương sẽ chết và trở lại điểm sinh sản. Nếu các gian lận được bật, người chơi có thể chuyển sang chế độ Sinh tồn bằng cách sử dụng lệnh / chế độ trò chơi sinh tồn nhưng không thể kiếm được thành tích.
zh_cn: 生存模式是Minecraft中的主要游戏模式之一。玩家必须收集资源，建造建筑物，与暴民作战，进食并探索世界，才能蓬勃发展和生存。在“基岩版”中，玩家在玩“生存模式”时关闭了作弊，关闭了附加组件并禁用了主机特权时，可能会在未设置为“平坦”的世界中获得成就。如果玩家在创意模式下创建了一个世界，然后在生存模式下加载了该世界，则该玩家无法在该世界上获得成就。在《我的世界》中，生存的主要目标是生存，建立，探索和玩乐，但生存中的一个可选目标是击败Ender Dragon和Wither。在生存中，玩家有一个清单来收集物品。与“创意”模式不同，所有“方块”都需要一定的时间才能打破，在“创意”模式下，您可以立即破坏方块。这些项目可用于配方中以创建工具，包括（镐，斧，剑，Ho，铲）和其他项目。单击左下角的食谱书，也可以更轻松地访问食谱。此过程称为制作。大多数手工食谱都需要一个手工桌子。有些物品无法通过正常加工获得，需要使用炉子进行加工。存在用于其他用途的各种其他制作工位，例如酿造，维修和附魔。在生存模式下，玩家可以从环境（跌落伤害，窒息和熔岩）和敌对的暴民（除非在和平的情况下玩耍，而敌对的暴民被禁用）受到伤害。受到足够伤害的玩家死亡并返回到生成点。如果启用了作弊功能，则玩家可以使用/ gamemode生存命令切换到生存模式，但无法获得成就。
zh_hant: 生存模式是Minecraft中的主要遊戲模式之一。玩家必須收集資源，建造建築物，與暴民作戰，進食並探索世界，才能蓬勃發展和生存。在“基岩版”中，玩家可能會在不使用作弊功能，關閉附加功能和關閉主機特權的情況下玩“生存模式”時在未設置為“平坦”的世界中獲得成就。如果玩家在創意模式下創建了一個世界，然後在生存模式下加載了該世界，則該玩家無法在該世界上獲得成就。在《我的世界》中，生存的主要目標是生存，建立，探索和玩樂，但生存中的一個可選目標是擊敗Ender Dragon和Wither。在生存中，玩家有一個清單來收集物品。與“創意”模式不同，所有“方塊”都需要一定的時間才能打破，在“創意”模式下，您可以立即破壞方塊。這些項目可用於配方中以創建工具，包括（鎬，斧，劍，Ho，鏟）和其他項目。單擊左下角的食譜書，也可以更輕鬆地訪問食譜。此過程稱為製作。大多數手工食譜都需要一個手工桌子。有些物品無法通過正常加工獲得，需要使用爐子進行加工。存在用於其他用途的各種其他製作工位，例如釀造，維修和附魔。在生存模式下，玩家可以從環境（跌落傷害，窒息和熔岩）和敵對的暴民（除非在和平的情況下玩，敵對的暴民被禁用）受到傷害。受到足夠傷害的玩家死亡並返回到生成點。如果啟用了作弊功能，則玩家可以使用/ gamemode生存命令切換到生存模式，但無法獲得成就。

# gamode_crtv_section
source: Creative
es_es: Creativo
fil_ph: Malikhain
id_id: Kreatif
km_kh: ច្នៃប្រឌិត
ms_my: Kreatif
th_th: สร้างสรรค์
vi_vn: Sáng tạo
zh_cn: 创意性
zh_hant: 創意性
