Repository: MyUser740/Minecraft-Server
Catalog: Minecraft-Server/App_LocalResources/Home.*.resx
Languages: es_es, fil_ph, id_id, km_kh, ms_my, th_th, vi_vn, zh_cn, zh_hant

# thx_title
source: Big Thank For
es_es: Muchas gracias por
fil_ph: Bid Salamat Para sa
id_id: Terima kasih untuk
km_kh: អរគុណធំ
ms_my: Terima Kasih Besar
th_th: ขอบคุณมากสำหรับ
vi_vn: Cảm ơn rất nhiều
zh_cn: 竞标感谢
zh_hant: 競標感謝
