Repository: MyUser740/Minecraft-Server
Catalog: Minecraft-Server/App_LocalResources/Home.*.resx
Languages: es_es, fil_ph, id_id, km_kh, ms_my, th_th, vi_vn, zh_cn, zh_hant

# gamemode_crtv_content
source: Creative mode is one of the main game modes in Minecraft. Creative mode strips away the survival aspects of Minecraft and allows players to easily create and destroy structures and mechanisms with the inclusion of an infinite use of blocks and flying. It also changes the background music. In Creative mode, players have no health or hunger bar to hamper their building (though it is still possible to eat, and the player's health still goes down if they take damage from the void). Creative mode allows players to destroy all blocks instantly (including normally-indestructible blocks such as bedrock and end portal frames), provided they are not holding a sword, trident or debug stick. However, these blocks are not dropped and must be obtained by the creative inventory. Creative mode gives players the ability to fly. To activate flying, double-tap the jump key. Use the jump key to go up and the sneak key to go down and the movement keys, the default is WASD to move. The player can disable flying in mid-air by double-tapping jump again, causing them to drop to the ground. Touching the ground when flying disables flying in Java Edition, but not in Bedrock Edition. Getting into a minecart or bed does not disable flying.
es_es: El modo creativo es uno de los principales modos de juego de Minecraft. El modo creativo elimina los aspectos de supervivencia de Minecraft y permite a los jugadores crear y destruir estructuras y mecanismos fácilmente con la inclusión de un uso infinito de bloques y vuelo. También cambia la música de fondo. En el modo Creativo, los jugadores no tienen barra de salud o hambre que obstaculice su construcción (aunque todavía es posible comer, y la salud del jugador aún disminuye si reciben daño del vacío). El modo creativo permite a los jugadores destruir todos los bloques al instante (incluidos los bloques normalmente indestructibles como el lecho de roca y los marcos del portal final), siempre que no estén sosteniendo una espada, un tridente o un palo de depuración. Sin embargo, estos bloques no se eliminan y deben obtenerse mediante el inventario de creatividades. El modo creativo les da a los jugadores la habilidad de volar. Para activar el vuelo, toque dos veces la tecla de salto. Use la tecla de salto para subir y la tecla de furtivo para bajar y las teclas de movimiento, el valor predeterminado es WASD para moverse. El jugador puede inhabilitar el vuelo en el aire haciendo doble clic para saltar nuevamente, lo que hace que caigan al suelo. Tocar el suelo al volar desactiva el vuelo en Java Edition, pero no en Bedrock Edition. Subirse a un vagón de minas o una cama no impide el vuelo.
fil_ph: Ang Creative mode ay isa sa pangunahing mga mode ng laro sa Minecraft. Tinatanggal ng Creative mode ang mga aspeto ng kaligtasan ng Minecraft at pinapayagan ang mga manlalaro na madaling lumikha at sirain ang mga istraktura at mekanismo na may pagsasama ng isang walang katapusang paggamit ng mga bloke at paglipad. Binabago din nito ang background music. Sa Creative mode, ang mga manlalaro ay walang kalusugan o gutom bar upang hadlangan ang kanilang gusali (kahit na posible pang kumain, at bumababa pa rin ang kalusugan ng manlalaro kung magkakaroon sila ng pinsala mula sa walang bisa). Pinapayagan ng Creative mode ang mga manlalaro na sirain agad ang lahat ng mga bloke (kasama ang mga normal na hindi masisira na mga bloke tulad ng bedrock at pagtatapos ng mga frame ng portal), sa kondisyon na hindi sila may hawak na isang tabak, trident o debug stick. Gayunpaman, ang mga bloke na ito ay hindi nahulog at dapat makuha ng imbentaryo ng malikhaing. Nagbibigay ang Creative mode ng mga manlalaro ng kakayahang lumipad. Upang mai-aktibo ang paglipad, i-double tap ang jump key. Gamitin ang jump key upang umakyat at ang sneak key upang bumaba at ang mga key ng paggalaw, ang default ay WASD upang ilipat. Maaaring hindi paganahin ng manlalaro ang paglipad sa kalagitnaan ng hangin sa pamamagitan ng pag-double-tap jump muli, na sanhi upang mahulog sila sa lupa. Ang pagpindot sa lupa kapag lumilipad ay hindi pinagagana ang paglipad sa Java Edition, ngunit hindi sa Bedrock Edition. Ang pagpasok sa isang minecart o kama ay hindi pinapagana ang paglipad.
id_id: Mode kreatif adalah salah satu mode permainan utama di Minecraft. Mode kreatif menghilangkan aspek kelangsungan hidup Minecraft dan memungkinkan pemain untuk dengan mudah membuat dan menghancurkan struktur dan mekanisme dengan memasukkan penggunaan blok dan terbang yang tak terbatas. Itu juga mengubah musik latar. Dalam mode Kreatif, pemain tidak memiliki bar kesehatan atau kelaparan untuk menghambat bangunan mereka (meskipun masih memungkinkan untuk makan, dan kesehatan pemain masih turun jika mereka menerima kerusakan dari kekosongan). Mode kreatif memungkinkan pemain untuk menghancurkan semua blok secara instan (termasuk blok yang biasanya tidak bisa dihancurkan seperti batuan dasar dan bingkai portal akhir), asalkan mereka tidak memegang pedang, trisula, atau tongkat debug. Namun, pemblokiran ini tidak dihapus dan harus diperoleh oleh inventaris materi iklan. Mode kreatif memberi pemain kemampuan untuk terbang. Untuk mengaktifkan terbang, ketuk dua kali tombol lompat. Gunakan tombol lompat untuk naik dan kunci diam untuk turun dan tombol gerakan, defaultnya adalah WASD untuk bergerak. Pemain dapat menonaktifkan terbang di udara dengan mengetuk dua kali lompatan lagi, menyebabkan mereka jatuh ke tanah. Menyentuh tanah saat terbang menonaktifkan terbang di Edisi Java, tetapi tidak di Edisi Batuan Dasar. Masuk ke kereta tambang atau tempat tidur tidak menonaktifkan terbang.
km_kh: របៀបច្នៃប្រឌិតគឺជារបៀបលេងហ្គេមដ៏សំខាន់មួយនៅក្នុង Minecraft ។ របៀបច្នៃប្រឌិតដកចេញនូវទិដ្ឋភាពនៃការរស់រានមានជីវិតនៃ Minecraft និងអនុញ្ញាតឱ្យអ្នកលេងបង្កើតនិងបំផ្លាញរចនាសម្ព័ន្ធនិងយន្តការយ៉ាងងាយស្រួលដោយរួមបញ្ចូលការប្រើប្រាស់ប្លុកនិងការហោះហើរដែលគ្មានកំណត់។ វាក៏ផ្លាស់ប្តូរតន្ត្រីផ្ទៃខាងក្រោយផងដែរ។ នៅក្នុងរបៀបច្នៃប្រឌិតអ្នកលេងមិនមានបញ្ហាសុខភាពឬអត់ឃ្លានដើម្បីរារាំងអគាររបស់ពួកគេ (ទោះបីជាវាអាចបរិភោគបានក៏ដោយហើយសុខភាពរបស់អ្នកលេងនៅតែធ្លាក់ចុះប្រសិនបើពួកគេយកការខូចខាតពីមោឃៈ) ។ របៀបច្នៃប្រឌិតអនុញ្ញាតឱ្យអ្នកលេងបំផ្លាញប្លុកទាំងអស់ភ្លាមៗ (រាប់បញ្ចូលទាំងប្លុកដែលមិនអាចបំផ្លាញបានដូចជាថ្មគោលនិងស៊ុមទ្វារចុងក្រោយ) ប្រសិនបើពួកគេមិនកាន់ដាវទ្រនាប់ឬដំបងបំបាត់កំហុស។ ទោះជាយ៉ាងណាក៏ដោយប្លុកទាំងនេះមិនត្រូវបានទម្លាក់ទេហើយត្រូវតែទទួលបានដោយសារពើភ័ណ្ឌច្នៃប្រឌិត។ របៀបច្នៃប្រឌិតផ្តល់ឱ្យអ្នកលេងនូវសមត្ថភាពហោះហើរ។ ដើម្បីធ្វើឱ្យការហោះហើរសកម្មសូមប៉ះប៊ូតុងលោតទ្វេ។ ប្រើគ្រាប់ចុចលោតដើម្បីឡើងលើនិងគ្រាប់ចុចជ្រលក់ដើម្បីចុះក្រោមនិងគ្រាប់ចុចចលនាលំនាំដើមគឺ WASD ដើម្បីផ្លាស់ទី។ អ្នកលេងអាចបិទការហោះហើរនៅពាក់កណ្តាលខ្យល់ដោយលោតទ្វេដងម្តងទៀតដែលបណ្តាលឱ្យពួកគេធ្លាក់ចុះដល់ដី។ ការប៉ះដីនៅពេលហោះហើរមិនអនុញ្ញាតឱ្យហោះហើរនៅចាវ៉ាបោះពុម្ពលើកប៉ុន្តែមិនមែននៅក្នុងឌីដ្រូកបោះពុម្ពទេ។ ការចូលក្នុងអណ្តូងរ៉ែឬគ្រែមិនបិទការហោះហើរទេ។
ms_my: Mod kreatif adalah salah satu mod permainan utama di Minecraft. Mod kreatif menghilangkan aspek kelangsungan hidup Minecraft dan membolehkan pemain membuat dan memusnahkan struktur dan mekanisme dengan mudah dengan penyertaan penggunaan blok dan terbang yang tidak terbatas. Ia juga mengubah muzik latar. Dalam mod Kreatif, pemain tidak mempunyai bar kesihatan atau kelaparan untuk mengganggu bangunan mereka (walaupun masih boleh dimakan, dan kesihatan pemain masih merosot jika mereka mengalami kerosakan akibat kekosongan). Mod kreatif membolehkan pemain menghancurkan semua blok dengan serta-merta (termasuk blok yang biasanya tidak dapat dihancurkan seperti bingkai dasar dan bingkai portal akhir), dengan syarat mereka tidak memegang pedang, trisula atau debug stick. Walau bagaimanapun, blok ini tidak dijatuhkan dan mesti diperolehi oleh inventori kreatif. Mod kreatif memberi pemain kemampuan untuk terbang. Untuk mengaktifkan penerbangan, ketik dua kali kekunci lompat. Gunakan tombol lompat untuk naik dan kunci menyelinap untuk turun dan kekunci pergerakan, lalai adalah WASD untuk bergerak. Pemain boleh melumpuhkan terbang di udara dengan melompat dua kali sekali lagi, menyebabkan mereka jatuh ke tanah. Menyentuh tanah ketika terbang melumpuhkan terbang di Edisi Java, tetapi tidak di Edisi Bedrock. Masuk ke minecart atau tempat tidur tidak mematikan penerbangan.
th_th: โหมดสร้างสรรค์เป็นหนึ่งในโหมดเกมหลักใน Minecraft โหมดครีเอทีฟจะดึงแง่มุมการเอาชีวิตรอดของ Minecraft ออกไปและช่วยให้ผู้เล่นสามารถสร้างและทำลายโครงสร้างและกลไกได้อย่างง่ายดายด้วยการใช้บล็อกและการบินที่ไม่สิ้นสุด นอกจากนี้ยังเปลี่ยนเพลงพื้นหลัง ในโหมดสร้างสรรค์ผู้เล่นไม่มีพลังชีวิตหรือแถบความหิวที่จะขัดขวางการสร้างของพวกเขา (แม้ว่าจะยังกินได้และสุขภาพของผู้เล่นยังคงลดลงหากพวกเขาได้รับความเสียหายจากความว่างเปล่า) โหมดสร้างสรรค์ช่วยให้ผู้เล่นสามารถทำลายบล็อกทั้งหมดได้ทันที (รวมถึงบล็อกที่ทำลายไม่ได้ตามปกติเช่นฐานรากและเฟรมประตูท้าย) หากพวกเขาไม่ได้ถือดาบตรีศูลหรือไม้แก้จุดบกพร่อง อย่างไรก็ตามการบล็อกเหล่านี้จะไม่ตกหล่นและต้องได้รับจากคลังโฆษณา โหมดสร้างสรรค์ช่วยให้ผู้เล่นสามารถบินได้ ในการเปิดใช้งานการบินให้แตะสองครั้งที่ปุ่มกระโดด ใช้ปุ่มกระโดดเพื่อขึ้นและปุ่มแอบเพื่อลงและปุ่มการเคลื่อนไหวค่าเริ่มต้นคือ WASD เพื่อย้าย ผู้เล่นสามารถปิดการบินกลางอากาศได้โดยการกระโดดสองครั้งอีกครั้งทำให้พวกเขาตกลงสู่พื้น การสัมผัสพื้นเมื่อบินจะปิดใช้งานการบินใน Java Edition แต่ไม่ใช่ใน Bedrock Edition การเข้าไปในรถมินิคาร์ทหรือเตียงไม่ได้ปิดการบิน
vi_vn: Chế độ sáng tạo là một trong những chế độ chơi chính trong Minecraft. Chế độ sáng tạo loại bỏ các khía cạnh sinh tồn của Minecraft và cho phép người chơi dễ dàng tạo và phá hủy các cấu trúc và cơ chế với việc sử dụng vô hạn các khối và bay. Nó cũng thay đổi nhạc nền. Trong chế độ Sáng tạo, người chơi không có thanh máu hoặc thanh đói để cản trở việc xây dựng của họ (mặc dù vẫn có thể ăn, và sức khỏe của người chơi vẫn giảm nếu họ nhận sát thương từ khoảng trống). Chế độ sáng tạo cho phép người chơi phá hủy tất cả các khối ngay lập tức (bao gồm cả các khối thông thường không thể phá hủy như nền móng và khung cổng cuối), miễn là họ không cầm kiếm, đinh ba hoặc gậy gỡ rối. Tuy nhiên, các khối này không bị rơi ra và phải có được bằng khoảng không quảng cáo. Chế độ sáng tạo cung cấp cho người chơi khả năng bay. Để kích hoạt bay, hãy nhấn đúp vào phím nhảy. Sử dụng phím nhảy để đi lên và phím lẻn để đi xuống và các phím di chuyển, mặc định là WASD để di chuyển. Người chơi có thể vô hiệu hóa tính năng bay giữa không trung bằng cách nhấn đúp lần nữa để nhảy, khiến chúng rơi xuống đất. Chạm đất khi bay sẽ vô hiệu hóa tính năng bay trong Phiên bản Java, nhưng không có trong Phiên bản Bedrock. Vào trong xe bom hoặc giường không có nghĩa là bay.
zh_cn: 创作模式是Minecraft中的主要游戏模式之一。创新模式剥夺了Minecraft的生存空间，并允许玩家轻松地创建和破坏建筑物和机制，包括无限使用方块和飞行。它还会更改背景音乐。在“创作”模式下，玩家没有健康或饥饿栏来妨碍他们的建筑物（尽管仍然可以进食，并且如果受到空洞的伤害，玩家的健康仍然会下降）。创作模式允许玩家立即摧毁所有方块（包括通常坚不可摧的方块，例如基岩和末端传送门框架），前提是他们没有握住剑，三叉戟或调试棒。但是，这些块不会丢失，必须由广告资源获取。创意模式使玩家能够飞行。要启动飞行，请点按两次跳转键。使用跳转键向上移动，使用潜行键向下移动，使用移动键，默认为WASD移动。玩家可以通过再次双击跳动使其掉落到地面来禁用空中飞行。飞行时触摸地面会禁止在Java Edition中飞行，但在Bedrock Edition中则不会。进入矿车或床上不会阻止飞行。
zh_hant: 創作模式是Minecraft中的主要遊戲模式之一。創新模式剝奪了Minecraft的生存空間，並允許玩家輕鬆地創建和破壞建築物和機制，包括無限使用方塊和飛行。它還會更改背景音樂。在“創作”模式下，玩家沒有健康​​或飢餓欄來妨礙他們的建築物（儘管仍然可以進食，並且如果受到空洞的傷害，玩家的健康仍然會下降）。創作模式允許玩家立即摧毀所有方塊（包括通常堅不可摧的方塊，例如基岩和末端傳送門框架），前提是他們沒有握住劍，三叉戟或調試棒。但是，這些塊不會丟失，必須由廣告資源獲取。創意模式使玩家能夠飛行。要激活飛行，請雙擊跳轉鍵。使用跳轉鍵向上移動，使用潛行鍵向下移動，使用移動鍵，默認為WASD移動。玩家可以通過再次雙擊跳動使其掉落到地面來禁用空中飛行。飛行時觸摸地面會禁止在Java Edition中飛行，但在Bedrock Edition中則不會。進入礦車或床上不會阻止飛行。

# gamode_advn_section
source: Adventure
es_es: Aventuras
fil_ph: Pakikipagsapalaran
id_id: Petualangan
km_kh: ដំណើរផ្សងព្រេង
ms_my: Pengembaraan
th_th: การผจญภัย
vi_vn: Cuộc phiêu lưu
zh_cn: 冒险
zh_hant: 冒險
