Repository: MyUser740/Minecraft-Server
Catalog: Minecraft-Server/App_LocalResources/Home.*.resx
Languages: es_es, fil_ph, id_id, km_kh, ms_my, th_th, vi_vn, zh_cn, zh_hant

# gamode_advn_content
source: Adventure mode is a game mode intended for player-created maps, limiting some of the gameplay in Minecraft. In this mode, the player cannot directly destroy any blocks with any tools or place any blocks, in order to avoid spoiling adventure maps or griefing servers. Adventure mode is accessible only with commands or the game mode selector. Adventure mode is similar to Survival in that players receive damage from their environment, dying is possible, and players must manage hunger. However, it is different in many ways as well. In the Java Edition, blocks can be destroyed only with an item/tool that has the CanDestroy NBT tag, and cannot be destroyed by the player's fist. Likewise, blocks require the CanPlaceOn NBT tag to be placed. In Bedrock Edition, similarly, can_destroy and can_place_on NBT tags are required to destroy and place blocks. However, players are able to make use of the environment in other ways - including interacting with mobs and other entities (for example, killing them), turning a redstone mechanism (such as a lever) on or off, and trading with villagers. Additionally, players are able to craft items as they normally would in any other game mode. Another feature is that players always spawn exactly on the world spawn point, no matter where it is - unlike Survival mode, where players can spawn anywhere within a certain grid.
es_es: El modo Aventura es un modo de juego diseñado para mapas creados por jugadores, lo que limita parte del juego en Minecraft. En este modo, el jugador no puede destruir directamente ningún bloque con ninguna herramienta o colocar ningún bloque, para evitar estropear los mapas de aventuras o los servidores en duelo. El modo Aventura es accesible solo con comandos o el selector de modo de juego. El modo Aventura es similar a Supervivencia en que los jugadores reciben daño de su entorno, es posible morir y los jugadores deben manejar el hambre. Sin embargo, también es diferente en muchos aspectos. En la Edición Java, los bloques solo se pueden destruir con un elemento / herramienta que tenga la etiqueta CanDestroy NBT, y no se pueden destruir con el puño del jugador. Asimismo, los bloques requieren que se coloque la etiqueta CanPlaceOn NBT. En Bedrock Edition, de manera similar, las etiquetas can_destroy y can_place_on NBT son necesarias para destruir y colocar bloques. Sin embargo, los jugadores pueden hacer uso del entorno de otras formas, como interactuar con turbas y otras entidades (por ejemplo, matarlas), encender o apagar un mecanismo de piedra roja (como una palanca) y comerciar con los aldeanos. Además, los jugadores pueden crear artículos como lo harían normalmente en cualquier otro modo de juego. Otra característica es que los jugadores siempre aparecen exactamente en el punto de generación del mundo, sin importar dónde esté, a diferencia del modo Supervivencia, donde los jugadores pueden generar en cualquier lugar dentro de una determinada cuadrícula.
fil_ph: Ang mode ng pakikipagsapalaran ay isang mode ng laro na inilaan para sa mga mapa na nilikha ng manlalaro, nililimitahan ang ilan sa mga gameplay sa Minecraft. Sa mode na ito, ang manlalaro ay hindi maaaring direktang sirain ang anumang mga bloke sa anumang mga tool o ilagay ang anumang mga bloke, upang maiwasan ang pagkasira ng mga mapang pakikipagsapalaran o mga server ng kalungkutan. Maa-access lamang ang mode ng pakikipagsapalaran sa mga utos o tagapili ng mode ng laro. Ang mode ng pakikipagsapalaran ay katulad ng Kaligtasan ng buhay na ang mga manlalaro ay tumatanggap ng pinsala mula sa kanilang kapaligiran, posible ang pagkamatay, at dapat pamahalaan ng mga manlalaro ang gutom. Gayunpaman, iba ito sa maraming paraan din. Sa Java Edition, ang mga bloke ay maaaring masira lamang sa isang item / tool na mayroong tag na CanDestroy NBT, at hindi maaaring sirain ng kamao ng manlalaro. Gayundin, ang mga bloke ay nangangailangan ng tag na CanPlaceOn NBT na mailagay. Sa Bedrock Edition, kapareho nito, ang mga can_destroy at can_place_on NBT na mga tag ay kinakailangan upang sirain at ilagay ang mga bloke. Gayunpaman, nagawang gamitin ng mga manlalaro ang kapaligiran sa iba pang mga paraan - kabilang ang pakikipag-ugnay sa mga nagkakagulong mga tao at iba pang mga nilalang (halimbawa, pagpatay sa kanila), pag-on o pag-off o mekanismo ng redstone (tulad ng isang pingga), at pakikipagkalakalan sa mga tagabaryo. Bilang karagdagan, ang mga manlalaro ay nakagagawa ng mga item tulad ng karaniwang ginagawa nila sa anumang iba pang mode ng laro. Ang isa pang tampok ay ang mga manlalaro na laging nagbubunga nang eksakto sa mundo na itlog ng itlog, hindi alintana kung nasaan ito - hindi katulad ng Survival mode, kung saan ang mga manlalaro ay maaaring itlog kahit saan sa loob ng isang tiyak na grid.
id_id: Mode petualangan adalah mode permainan yang ditujukan untuk peta yang dibuat oleh pemain, membatasi beberapa gameplay di Minecraft. Dalam mode ini, pemain tidak dapat langsung menghancurkan blok apa pun dengan alat apa pun atau menempatkan blok apa pun, untuk menghindari merusak peta petualangan atau server duka. Mode petualangan hanya dapat diakses dengan perintah atau pemilih mode permainan. Mode petualangan mirip dengan Survival di mana pemain menerima kerusakan dari lingkungan mereka, kematian dimungkinkan, dan pemain harus mengelola rasa lapar. Namun, dalam banyak hal juga berbeda. Dalam Java Edition, blok hanya dapat dihancurkan dengan item / alat yang memiliki tag CanDestroy NBT, dan tidak dapat dihancurkan oleh tangan pemain. Demikian juga, blok memerlukan tag CanPlaceOn NBT untuk ditempatkan. Dalam Edisi Bedrock, tag NBT can_destroy dan can_place_on juga diperlukan untuk menghancurkan dan menempatkan blok. Namun, pemain dapat memanfaatkan lingkungan dengan cara lain - termasuk berinteraksi dengan massa dan entitas lain (misalnya, membunuh mereka), mengaktifkan atau menonaktifkan mekanisme redstone (seperti tuas), dan berdagang dengan penduduk desa. Selain itu, pemain dapat membuat item seperti biasanya dalam mode permainan lainnya. Fitur lainnya adalah pemain selalu bertelur tepat di titik spawn dunia, di mana pun itu - tidak seperti mode Survival, di mana pemain dapat bertelur di mana saja dalam grid tertentu.
km_kh: របៀបផ្សងព្រេងគឺជារបៀបលេងហ្គេមដែលត្រូវបានបម្រុងទុកសម្រាប់ផែនទីដែលបង្កើតដោយអ្នកលេងដោយកំណត់ល្បែងមួយចំនួននៅក្នុង Minecraft ។ នៅក្នុងរបៀបនេះអ្នកលេងមិនអាចបំផ្លាញប្លុកដោយផ្ទាល់ដោយប្រើឧបករណ៍ឬដាក់ប្លុកណាមួយដើម្បីចៀសវាងផែនទីផ្សងព្រេងឬម៉ាស៊ីនមេដែលសោកសៅ។ របៀបផ្សងព្រេងអាចចូលបានតែជាមួយពាក្យបញ្ជាឬឧបករណ៍ជ្រើសរើសរបៀបលេងហ្គេមប៉ុណ្ណោះ។ របៀបផ្សងព្រេងគឺស្រដៀងនឹងការរស់រានមានជីវិតដែលអ្នកលេងទទួលបានការខូចខាតពីបរិយាកាសរបស់ពួកគេការស្លាប់អាចទៅរួចហើយអ្នកលេងត្រូវតែគ្រប់គ្រងភាពអត់ឃ្លាន។ ទោះយ៉ាងណាក៏ដោយវាខុសគ្នាតាមវិធីជាច្រើន។ នៅក្នុង Java Edition ប្លុកអាចត្រូវបានបំផ្លាញតែជាមួយធាតុ / ឧបករណ៍ដែលមានស្លាក CanDestroy NBT ហើយមិនអាចត្រូវបានបំផ្លាញដោយកណ្តាប់ដៃរបស់អ្នកលេងឡើយ។ ដូចគ្នានេះដែរប្លុកតម្រូវឱ្យដាក់ស្លាក CanPlaceOn NBT ។ នៅក្នុង Bedrock Edition ស្រដៀងគ្នានេះដែរស្លាក - អាចនិងកន្លែង NBT ត្រូវបានទាមទារដើម្បីបំផ្លាញនិងដាក់ប្លុក។ ទោះយ៉ាងណាអ្នកលេងអាចប្រើប្រាស់បរិស្ថានតាមរបៀបផ្សេងទៀត - រួមទាំងការប្រាស្រ័យទាក់ទងជាមួយហ្វូងមនុស្សនិងអង្គភាពដទៃទៀត (ឧទាហរណ៍ការសម្លាប់ពួកគេ) បង្វែរយន្ដការក្រួសក្រហម (ដូចជាដងថ្លឹង) បើកនិងធ្វើពាណិជ្ជកម្មជាមួយអ្នកភូមិ។ លើសពីនេះទៀតអ្នកលេងអាចធ្វើគ្រឿងសិប្បកម្មបានដូចដែលពួកគេនឹងធ្វើនៅក្នុងរបៀបល្បែងផ្សេងទៀត។ លក្ខណៈពិសេសមួយទៀតគឺថាអ្នកលេងតែងតែពងនៅលើចំណុចពងកូនពិភពលោកមិនថាវានៅទីណាទេ - មិនដូចរបៀបរស់រានមានជីវិតដែលអ្នកលេងអាចពងបានគ្រប់ទីកន្លែងក្នុងក្រឡាចត្រង្គជាក់លាក់។
ms_my: Mod petualangan adalah mod permainan yang ditujukan untuk peta buatan pemain, sehingga membatasi beberapa permainan di Minecraft. Dalam mod ini, pemain tidak dapat secara langsung menghancurkan blok dengan alat apa pun atau meletakkan blok apa pun, untuk mengelakkan merosakkan peta petualangan atau pelayan yang menyedihkan. Mod petualangan hanya dapat diakses dengan perintah atau pemilih mod permainan. Mod petualangan serupa dengan Survival di mana pemain menerima kerosakan dari persekitaran mereka, kematian mungkin, dan pemain mesti mengatasi rasa lapar. Walau bagaimanapun, ia juga berbeza dalam banyak cara. Dalam Edisi Java, blok dapat dihancurkan hanya dengan item / alat yang memiliki tag CanDestroy NBT, dan tidak dapat dihancurkan oleh penumbuk pemain. Begitu juga, blok memerlukan tag CanPlaceOn NBT diletakkan. Dalam Edisi Bedrock, serupa, tag can_destroy dan can_place_on NBT diperlukan untuk memusnahkan dan meletakkan blok. Walau bagaimanapun, pemain dapat memanfaatkan persekitaran dengan cara lain - termasuk berinteraksi dengan massa dan entiti lain (misalnya, membunuhnya), menghidupkan atau mematikan mekanisme redstone (seperti tuas), dan berdagang dengan penduduk kampung. Selain itu, pemain dapat membuat item seperti biasa dalam mod permainan lain. Ciri lain ialah pemain selalu bertelur tepat di titik pemijahan dunia, di mana pun ia berada - tidak seperti mod Survival, di mana pemain dapat bertelur di mana sahaja dalam grid tertentu.
th_th: โหมดผจญภัยเป็นโหมดเกมที่มีไว้สำหรับแผนที่ที่ผู้เล่นสร้างขึ้นโดย จำกัด การเล่นเกมบางส่วนใน Minecraft ในโหมดนี้ผู้เล่นไม่สามารถทำลายบล็อกด้วยเครื่องมือใด ๆ โดยตรงหรือวางบล็อกใด ๆ เพื่อหลีกเลี่ยงการทำลายแผนที่การผจญภัยหรือเซิร์ฟเวอร์ที่ทำให้เศร้าโศก โหมดผจญภัยสามารถเข้าถึงได้ด้วยคำสั่งหรือตัวเลือกโหมดเกมเท่านั้น โหมดผจญภัยคล้ายกับการอยู่รอดตรงที่ผู้เล่นได้รับความเสียหายจากสภาพแวดล้อมการตายเป็นไปได้และผู้เล่นต้องจัดการกับความหิว อย่างไรก็ตามมันก็แตกต่างกันในหลาย ๆ ด้านเช่นกัน ใน Java Edition บล็อกสามารถทำลายได้ด้วยไอเท็ม / เครื่องมือที่มีแท็ก CanDestroy NBT เท่านั้นและไม่สามารถทำลายได้ด้วยกำปั้นของผู้เล่น ในทำนองเดียวกันบล็อกต้องใช้แท็ก CanPlaceOn NBT เพื่อวาง ใน Bedrock Edition ในทำนองเดียวกันแท็ก can_destroy และ can_place_on NBT เพื่อทำลายและวางบล็อก อย่างไรก็ตามผู้เล่นสามารถใช้ประโยชน์จากสภาพแวดล้อมในรูปแบบอื่น ๆ ได้เช่นการโต้ตอบกับฝูงชนและหน่วยงานอื่น ๆ (เช่นการฆ่าพวกมัน) การเปิดหรือปิดกลไกจับกลุ่ม (เช่นคันโยก) และการซื้อขายกับชาวบ้าน นอกจากนี้ผู้เล่นยังสามารถสร้างไอเท็มได้ตามปกติในโหมดเกมอื่น ๆ คุณสมบัติอีกประการหนึ่งคือผู้เล่นมักจะวางไข่ที่จุดวางไข่ของโลกไม่ว่าจะอยู่ที่ไหน - ต่างจากโหมดเอาชีวิตรอดที่ผู้เล่นสามารถวางไข่ได้ทุกที่ภายในตาราง
vi_vn: Chế độ phiêu lưu là một chế độ chơi dành cho các bản đồ do người chơi tạo, hạn chế một số lối chơi trong Minecraft. Trong chế độ này, người chơi không thể trực tiếp phá hủy bất kỳ khối nào bằng bất kỳ công cụ nào hoặc đặt bất kỳ khối nào, để tránh làm hỏng bản đồ phiêu lưu hoặc máy chủ đau buồn. Chế độ phiêu lưu chỉ có thể truy cập bằng các lệnh hoặc công cụ chọn chế độ trò chơi. Chế độ phiêu lưu tương tự như Survival ở chỗ người chơi nhận được thiệt hại từ môi trường của họ, chết là có thể và người chơi phải kiềm chế cơn đói. Tuy nhiên, nó cũng khác theo nhiều cách. Trong phiên bản Java, các khối chỉ có thể bị phá hủy bằng vật phẩm / công cụ có thẻ CanDestroy NBT và không thể bị phá hủy bằng nắm tay của người chơi. Tương tự như vậy, các khối yêu cầu phải đặt thẻ CanPlaceOn NBT. Tương tự, trong Bedrock Edition, các thẻ NBT can_destroy và can_place_on được yêu cầu để hủy và đặt các khối. Tuy nhiên, người chơi có thể sử dụng môi trường theo những cách khác - bao gồm tương tác với mob và các thực thể khác (ví dụ: giết chúng), bật hoặc tắt cơ chế redstone (chẳng hạn như đòn bẩy) và giao dịch với dân làng. Ngoài ra, người chơi có thể chế tạo các vật phẩm như bình thường trong bất kỳ chế độ chơi nào khác. Một tính năng khác là người chơi luôn xuất hiện chính xác vào điểm sinh sản trên thế giới, bất kể đó là ở đâu - không giống như chế độ Sinh tồn, nơi người chơi có thể sinh sản ở bất kỳ đâu trong một lưới nhất định.
zh_cn: 冒险模式是一种用于玩家创建地图的游戏模式，限制了Minecraft中的某些游戏玩法。在这种模式下，玩家无法使用任何工具直接销毁任何方块或放置任何方块，以避免破坏冒险地图或悲伤的服务器。冒险模式只能通过命令或游戏模式选择器访问。冒险模式与生存模式相似，因为玩家会受到周围环境的伤害，有可能死亡，并且玩家必须控制饥饿。但是，它在许多方面也有所不同。在Java Edition中，只能使用带有CanDestroy NBT标签的物品/工具来破坏积木，而不能被玩家的拳头破坏。同样，块需要放置CanPlaceOn NBT标签。在基岩版中，类似地，需要can_destroy和can_place_on NBT标签来销毁和放置块。但是，玩家可以通过其他方式利用环境-包括与暴民和其他实体互动（例如杀死他们），打开或关闭红石机制（例如杠杆）以及与村民交易。另外，玩家能够像在其他任何游戏模式中一样制作物品。另一个功能是，玩家无论在何处都始终精确地在世界上的生成点上生成-与生存模式不同，生存模式下，玩家可以在特定网格内的任何位置生成。
zh_hant: 冒險模式是一種用於玩家創建地圖的遊戲模式，限制了Minecraft中的某些遊戲玩法。在這種模式下，玩家無法使用任何工具直接銷毀任何方塊或放置任何方塊，以避免破壞冒險地圖或悲傷的服務器。冒險模式只能通過命令或遊戲模式選擇器訪問。冒險模式與生存模式相似，因為玩家會受到周圍環境的傷害，有可能死亡，並且玩家必須控制飢餓。但是，它在許多方面也有所不同。在Java Edition中，只能使用帶有CanDestroy NBT標籤的物品/工具來破壞積木，而不能被玩家的拳頭破壞。同樣，塊需要放置CanPlaceOn NBT標籤。在基岩版中，類似地，需要can_destroy和can_place_on NBT標籤來銷毀和放置塊。但是，玩家可以通過其他方式利用環境-包括與暴民和其他實體互動（例如，殺死它們），打開或關閉紅石機制（例如槓桿）以及與村民交易。另外，玩家能夠像在其他任何遊戲模式中一樣製作物品。另一個功能是，玩家無論身在何處，都始終精確地在世界的生成點上生成-與生存模式不同，生存模式下，玩家可以在特定網格內的任何位置生成。

# gamemode_hrdc_section
source: Hardcore
es_es: Núcleo duro
fil_ph: Mahirap na core
id_id: Inti keras
km_kh: ស្នូលរឹង
ms_my: Inti keras
th_th: ฮาร์ดคอร์
vi_vn: Lõi cứng
zh_cn: 铁杆
zh_hant: 鐵桿

# gamemode_hrdc_content
source: Hardcore is a Java Edition exclusive variant of Survival. In this mode, the world is locked to Hard difficulty and the player cannot respawn after being killed. The key feature of Hardcore mode is that the player is not given the option to respawn upon death as they would in other game modes. Instead, there are two buttons on the death screen: "Spectate world" and "Title screen." "Spectate world" sets the player to Spectator mode and respawns the player at the world's spawn point, making them able to view and explore the world only in that mode. The "Title screen" button simply leads the player to the main menu screen; re-opening the world simply returns the player back to the same death screen as before. In addition, Hardcore mode worlds are restricted to hard difficulty. When creating a Hardcore mode world, the Enable Cheats and Bonus Chest world options are locked to OFF. On the world selection menu, hardcore mode worlds display dark red text reading "Hardcore Mode!"
es_es: Hardcore es una variante exclusiva de la edición Java de Survival. En este modo, el mundo está bloqueado en dificultad Difícil y el jugador no puede reaparecer después de ser asesinado. La característica clave del modo Hardcore es que el jugador no tiene la opción de reaparecer al morir como lo haría en otros modos de juego. En cambio, hay dos botones en la pantalla de la muerte: "Mundo espectador" y "Pantalla de título". "Spectate world" establece al jugador en el modo Espectador y reaparece en el punto de generación del mundo, lo que le permite ver y explorar el mundo solo en ese modo. El botón "Pantalla de título" simplemente lleva al jugador a la pantalla del menú principal; reabrir el mundo simplemente devuelve al jugador a la misma pantalla de muerte que antes. Además, los mundos del modo Hardcore están restringidos a dificultad difícil. Al crear un mundo en modo Hardcore, las opciones de mundo Habilitar trucos y Cofre de bonificación están bloqueadas en APAGADO. En el menú de selección de mundo, los mundos del modo hardcore muestran un texto rojo oscuro que dice "¡Modo Hardcore!"
fil_ph: Ang Hardcore ay isang eksklusibong variant ng Java Edition ng Survival. Sa mode na ito, ang mundo ay naka-lock sa Hard kahirapan at ang manlalaro ay hindi maaaring muling magbigay ng tulong matapos na pinatay. Ang pangunahing tampok ng Hardcore mode ay ang manlalaro ay hindi binigyan ng pagpipilian upang muling magbigay ng kamatayan tulad ng gagawin nila sa iba pang mga mode ng laro. Sa halip, mayroong dalawang mga pindutan sa screen ng kamatayan: "Spectate world" at "Screen ng pamagat." Itinakda ng "Spectate world" ang manlalaro sa mode ng Spectator at respawns ng player sa spawn point ng mundo, na ginagawang tingnan at tuklasin ang mundo sa mode lamang na iyon. Ang pindutang "Pamagat ng screen" ay humahantong lamang sa manlalaro sa pangunahing menu ng menu; muling pagbubukas sa mundo ay ibabalik lamang ang manlalaro sa parehong screen ng kamatayan tulad ng dati. Bilang karagdagan, ang mga mundo ng Hardcore mode ay pinaghihigpitan sa mahirap na kahirapan. Kapag lumilikha ng isang Hardcore mode na mundo, ang mga pagpipilian sa Paganahin ang Mga Cheat at Bonus Chest na mundo ay naka-lock sa OFF. Sa menu ng pagpili ng mundo, ang mga mundo ng hardcore mode ay nagpapakita ng madilim na pulang teksto na nagbabasa ng "Hardcore Mode!"
id_id: Hardcore adalah varian eksklusif Survival Edisi Java. Dalam mode ini, dunia terkunci pada tingkat kesulitan Hard dan pemain tidak dapat respawn setelah dibunuh. Fitur utama dari mode Hardcore adalah bahwa pemain tidak diberikan opsi untuk respawn setelah mati seperti yang mereka lakukan dalam mode permainan lainnya. Sebaliknya, ada dua tombol di layar kematian: "Tonton dunia" dan "Layar judul". "Spectate world" mengatur pemain ke mode Penonton dan respawn pemain di titik spawn dunia, membuat mereka dapat melihat dan menjelajahi dunia hanya dalam mode itu. Tombol "Layar judul" hanya mengarahkan pemain ke layar menu utama; membuka kembali dunia hanya mengembalikan pemain ke layar kematian yang sama seperti sebelumnya. Selain itu, dunia mode Hardcore dibatasi untuk tingkat kesulitan keras. Saat membuat dunia mode Hardcore, opsi Enable Cheats dan Bonus Chest world dikunci ke OFF. Pada menu pilihan dunia, dunia mode hardcore menampilkan teks merah tua bertuliskan "Mode Hardcore!"
km_kh: Hardcore គឺជាវ៉ារ្យ៉ង់ផ្តាច់មុខរបស់ Java Edition នៃការរស់រានមានជីវិត។ នៅក្នុងរបៀបនេះពិភពលោកត្រូវបានចាក់សោរទៅនឹងការលំបាកហើយអ្នកលេងមិនអាចស្រោចស្រង់បន្ទាប់ពីត្រូវបានគេសម្លាប់។ លក្ខណៈពិសេសសំខាន់នៃរបៀប Hardcore គឺថាអ្នកលេងមិនត្រូវបានផ្តល់ជម្រើសដើម្បីធ្វើឱ្យធូរស្បើយនៅពេលដែលពួកគេស្លាប់នៅក្នុងរបៀបលេងហ្គេមផ្សេងទៀត។ ផ្ទុយទៅវិញមានប៊ូតុងពីរនៅលើអេក្រង់មរណៈ: "ពិភពលោកគួរឱ្យគោរព" និង "អេក្រង់ចំណងជើង" ។ “ ពិភពពិភពលោកដែលគួរឱ្យគោរព” កំណត់អ្នកលេងទៅជារបៀបអ្នកមើលនិងធ្វើឱ្យអ្នកលេងនៅចំណុចពងទឹកពិភពលោកធ្វើឱ្យពួកគេអាចមើលនិងរុករកពិភពលោកបានតែនៅក្នុងរបៀបនោះ។ ប៊ូតុង "អេក្រង់ចំណងជើង" គ្រាន់តែនាំអ្នកលេងទៅអេក្រង់ម៉ឺនុយមេ; ការបើកពិភពលោកឡើងវិញជាធម្មតាធ្វើឱ្យអ្នកលេងត្រលប់ទៅអេក្រង់ស្លាប់ដូចកាលពីមុន។ លើសពីនេះទៀតពិភពម៉ូដ Hardcore ត្រូវបានដាក់កម្រិតលើការលំបាក។ នៅពេលបង្កើតពិភពម៉ូដ Hardcore ជម្រើស Enable Cheats និង Bonus Chest world ត្រូវបានចាក់សោទៅបិទ។ នៅលើបញ្ជីជ្រើសរើសពិភពលោកពិភព hardcore បង្ហាញការអានអត្ថបទពណ៌ក្រហមងងឹត "របៀប Hardcore!"
ms_my: Hardcore adalah varian eksklusif Java Survival. Dalam mod ini, dunia terkunci dalam kesukaran Keras dan pemain tidak dapat bergerak semula setelah dibunuh. Ciri utama mod Hardcore adalah bahawa pemain tidak diberi pilihan untuk memberi respon ketika mati seperti yang mereka lakukan dalam mod permainan lain. Sebaliknya, terdapat dua butang di skrin mati: "Spectate world" dan "Screen title." "Spectate world" menetapkan pemain ke mod Spectator dan memberi respon kepada pemain pada titik spawn dunia, menjadikan mereka dapat melihat dan menjelajahi dunia hanya dalam mod tersebut. Butang "Skrin tajuk" hanya membawa pemain ke skrin menu utama; membuka semula dunia hanya mengembalikan pemain kembali ke skrin mati yang sama seperti sebelumnya. Di samping itu, dunia mod Tegar terhad kepada kesukaran yang sukar. Semasa membuat dunia mod Hardcore, pilihan Enable Cheats and Bonus Chest dikunci ke MATI. Pada menu pilihan dunia, dunia mod tegar memaparkan teks merah gelap yang berbunyi "Mod Tegar!"
th_th: Hardcore เป็นรูปแบบการเอาชีวิตรอดที่เป็นเอกสิทธิ์เฉพาะของ Java Edition ในโหมดนี้โลกถูกล็อคให้อยู่ในระดับความยากและผู้เล่นจะไม่สามารถเกิดใหม่ได้หลังจากถูกฆ่า คุณสมบัติที่สำคัญของโหมด Hardcore คือผู้เล่นไม่ได้รับตัวเลือกในการเกิดใหม่เมื่อตายเหมือนอย่างที่ทำในโหมดเกมอื่น ๆ แต่จะมีปุ่มสองปุ่มบนหน้าจอมรณะแทน: "โลกแห่งการมองเห็น" และ "หน้าจอชื่อเรื่อง" "โลกแห่งการมองเห็น" ตั้งค่าผู้เล่นเป็นโหมดผู้ชมและทำให้ผู้เล่นเกิดใหม่ ณ จุดเกิดของโลกทำให้พวกเขาสามารถดูและสำรวจโลกได้เฉพาะในโหมดนั้น ปุ่ม "Title screen" จะนำผู้เล่นไปที่หน้าจอเมนูหลัก การเปิดโลกใหม่เพียงแค่ทำให้ผู้เล่นกลับไปสู่หน้าจอมรณะเหมือนเดิม นอกจากนี้โลกของโหมด Hardcore ยังถูก จำกัด ให้อยู่ในระดับยาก เมื่อสร้างโลกในโหมดฮาร์ดคอร์ตัวเลือกเปิดใช้กลโกงและหีบโบนัสจะถูกล็อกเป็นปิด ในเมนูการเลือกโลกโลกของโหมดฮาร์ดคอร์จะแสดงข้อความสีแดงเข้มว่า "โหมดไม่ยอมใครง่ายๆ!"
vi_vn: Hardcore là một biến thể độc quyền của Phiên bản Java của Survival. Trong chế độ này, thế giới bị khóa ở độ khó Khó và người chơi không thể hồi sinh sau khi bị giết. Tính năng chính của chế độ Hardcore là người chơi không được cung cấp tùy chọn hồi sinh khi chết như trong các chế độ chơi khác. Thay vào đó, có hai nút trên màn hình chết: "Spectate world" và "Title screen." "Spectate world" đặt người chơi ở chế độ Spectator và hồi sinh người chơi tại điểm xuất hiện của thế giới, giúp họ chỉ có thể xem và khám phá thế giới trong chế độ đó. Nút "Màn hình tiêu đề" chỉ đơn giản là dẫn người chơi đến màn hình menu chính; mở lại thế giới chỉ đơn giản là đưa người chơi trở lại màn hình chết chóc như trước. Ngoài ra, các thế giới trong chế độ Hardcore bị hạn chế ở độ khó khó. Khi tạo thế giới ở chế độ Hardcore, các tùy chọn Bật Cheats và Bonus Chest thế giới bị khóa thành TẮT. Trên menu lựa chọn thế giới, các thế giới ở chế độ hạng nặng hiển thị dòng chữ màu đỏ sẫm đọc "Chế độ hạng nặng!"
zh_cn: Hardcore是Java Edition Survival的专有变体。 在这种模式下，世界被锁定为困难难度，玩家被杀死后无法重生。 核心模式的主要特点是，玩家没有像其他游戏模式那样在死亡时重生的选项。 取而代之的是，死亡屏幕上有两个按钮：“主题世界”和“标题屏幕”。 “ Spectate world”将玩家设置为“观众”模式，并在世界的生成点重生该玩家，从而使他们只能在该模式下查看和探索世界。 “标题屏幕”按钮只是将播放器引导至主菜单屏幕； 重新打开世界只会使玩家回到与以前相同的死亡屏幕。 此外，硬核模式世界仅限于困难难度。 创建“硬核”模式世界时，“启用作弊”和“奖励宝箱”世界选项将锁定为OFF。 在世界选择菜单上，“硬核模式”世界显示深红色文本，显示为“硬核模式！”。
zh_hant: Hardcore是Java Edition Survival的專有變體。 在這種模式下，世界被鎖定為困難難度，玩家被殺死後無法重生。 硬核模式的主要特徵是，玩家沒有像其他遊戲模式那樣在死亡時重生的選項。 取而代之的是，死亡屏幕上有兩個按鈕：“主題世界”和“標題屏幕”。 “ Spectate world”將玩家設置為“觀眾”模式，並在世界的生成點重生該玩家，從而使他們只能在該模式下查看和探索世界。 “標題屏幕”按鈕只是將播放器引導至主菜單屏幕； 重新打開世界只會使玩家回到與以前相同的死亡屏幕。 此外，硬核模式世界僅限於困難難度。 創建“硬核”模式世界時，“啟用作弊”和“獎勵寶箱”世界選項將鎖定為OFF。 在世界選擇菜單上，“硬核模式”世界顯示深紅色文本，顯示為“硬核模式！”。

source: Let's Play!
es_es: ¡Vamos a jugar!
fil_ph: Maglaro tayo!
id_id: Mari main!
km_kh: តោះ​ចាប់ផ្តើម​លេង!
ms_my: Jom main!
th_th: มาเล่นกัน!
vi_vn: Hãy chơi!
zh_cn: 让我们玩！
zh_hant: 讓我們玩！

# shop_title
source: Do you want to upgrade/buy rank?
es_es: ¿Quieres mejorar / comprar rango?
fil_ph: Nais mo bang mag-upgrade / bumili ng ranggo?
id_id: Apakah Anda ingin meningkatkan / membeli peringkat?
km_kh: តើអ្នកចង់ធ្វើឱ្យប្រសើរឡើង / ទិញលំដាប់?
ms_my: Adakah anda mahu menaik taraf / membeli pangkat?
th_th: คุณต้องการอัพเกรด / ซื้ออันดับหรือไม่?
vi_vn: Bạn có muốn nâng cấp / mua hạng?
zh_cn: 您想升级/购买等级吗？
zh_hant: 您想升級/購買等級嗎？

# shop_link
source: Go here
es_es: Ven aquí
fil_ph: Punta ka dito
id_id: Kesini
km_kh: ចូល​ទៅ​ទីនេះ
ms_my: Pergi ke sini
th_th: มานี่
vi_vn: Đến đây
zh_cn: 到这里
zh_hant: 到這裡

# thx1
source: Well...... Without me this minecraft never existed. Thank for your support
es_es: Bueno ... Sin mí, este Minecraft nunca existió. Gracias por su apoyo
fil_ph: Kaya ...... Kung wala ako wala itong minecraft na ito. Salamat sa iyong suporta
id_id: Nah ...... Tanpa saya minecraft ini tidak pernah ada. Terima kasih atas dukungannya
km_kh: អញ្ចឹង ...... បើគ្មានខ្ញុំយាននេះមិនដែលមានទេ។ សូមអរគុណសម្រាប់ការគាំទ្ររបស់អ្នក
ms_my: Baik ...... Tanpa saya minecraft ini tidak pernah wujud. Terima kasih atas sokongan anda
th_th: อืม ...... ถ้าไม่มีฉัน minecraft นี้ไม่เคยมีอยู่จริง ขอบคุณสำหรับการสนับสนุน
vi_vn: Chà ...... Không có tôi thì minecraft này không bao giờ tồn tại. Cảm ơn sự ủng hộ của bạn
zh_cn: 好吧……没有我，我的世界就不存在了。 感谢您的支持
zh_hant: 好吧……沒有我，我的世界就不存在了。 感謝您的支持

# thx2
source: Many thanks to the T-XIvIN Community for developing this site.
es_es: Muchas gracias a la comunidad T-XIvIN por desarrollar este sitio.
fil_ph: Maraming salamat sa Komunidad ng T-XIvIN para sa pagbuo ng site na ito.
id_id: Terima kasih banyak kepada Komunitas T-XIvIN yang telah mengembangkan situs ini.
km_kh: សូមថ្លែងអំណរគុណយ៉ាងជ្រាលជ្រៅដល់សហគមន៍ធីធីអ៊ិនជីនសម្រាប់ការអភិវឌ្ឍគេហទំព័រនេះ។
ms_my: Terima kasih banyak kepada Komuniti T-XIvIN kerana membangunkan laman web ini.
th_th: ขอบคุณมากสำหรับชุมชน T-XIvIN สำหรับการพัฒนาไซต์นี้
vi_vn: Rất cảm ơn Cộng đồng T-XIvIN đã phát triển trang web này.
zh_cn: 非常感谢T-XIvIN社区开发此网站。
zh_hant: 非常感謝T-XIvIN社區開發此網站。
