{
  "Texts": [
    {
      "id": "title_ServerAdvantages",
      "text": "我哋嘅Minecraft服務器優勢"
    },
    {
      "id": "adv_1",
      "text": "高速服務器"
    },
    {
      "id": "adv_2",
      "text": "私隱"
    },
    {
      "id": "adv_3",
      "text": "最佳社區"
    },
    {
      "id": "adv_4",
      "text": "24/7 託管"
    },
    {
      "id": "gamemode_Title",
      "text": "遊戲模式"
    },
    {
      "id": "gamemode_Subtitle",
      "text": "可用遊戲模式喺我哋嘅礦船服務器"
    },
    {
      "id": "gamode_surv_section",
      "text": "生存"
    },
    {
      "id": "gamemode_surv_content",
      "text": "生存模式係Minecraft中嘅主要遊戲模式之一。 玩家必須收集資源，建立結構，戰鬥生物，吃，探索世界，努力茁壯成長和生存。 Bedrock版中緊，玩家喺玩徜徉生存模式桎梏時可能會獲得成就，玩为生存模式并会作弊、附加組件關閉同主機特權關閉。 如果玩家在創作模式下創建世界，然後在生存模式下加載它，玩家無法在該世界中獲得成就。 在Minecraft生存中，主要目標係生存、建造、探索和樂趣，但生存中嘅可選目標係擊敗末條龍同生者。 在生存中，玩家有一個清單嚟收集物品。 所有塊需要一定嘅時間嚟打爛唔似創意模式，喺嗰度你可以立即摧毀蚊。 呢啲項目可用于配方創建工具，包括（皮卡克斯，斧頭，劍，剷子），鏟）同其他項目。 單擊左下角的食譜書，也可以更輕鬆地訪問食譜。 此過程稱為合成。 大多數製作食譜都需要一個製作表。 有些物品不能透過正常工藝獲得，需要一個熔爐進行加工。 各種其他製作站存在其他用途，如釀造，修復和迷人。 在生存模式的，玩家能夠受到來自環境（墜落傷害、窒息和熔岩）和敵對生物（除非在和平環境中玩耍，其中敵對生物被禁用）造成的損害。 受到足夠傷害的玩家死亡並返回產卵點。 如果啟用了作弊，玩家可以使用命令/遊戲模式生存切換到生存模式，但不能獲得成就。"
    },
    {
      "id": "gamode_crtv_section",
      "text": "創造性"
    },
    {
      "id": "gamemode_crtv_content",
      "text": "創意模式係Minecraft中嘅主要遊戲模式之一。 創意模式剝離咗Minecraft嘅生存方面，並允許玩家輕鬆地創建和破壞結構和機制，包括無限使用蚊同飛行。 它還會改變背景音樂。 在創意模式下，玩家沒有健康或飢餓欄來阻礙他們的建設（儘管仍然可以吃東西，如果玩家從空隙中受損，他們的健康仍然會下降）。 創意模式允許玩家立即摧毀所有方塊（包括通常堅不可摧的方塊，如基岩和端入口框架），前提是他們不持有劍、三叉星或調試棒。 但是，呢啲嚿唔會掉落，必須透過創意清單獲得。 創意模式讓玩家能夠飛行。 要激活飛行，請雙擊跳躍鍵。 使用跳鍵向上移動，偷偷鍵向下移動鍵，默認為WASD移動。 玩家可以透過再次雙擊跳躍嚟禁用喺半空中飛行，導致佢哋掉到地面。 飛行時觸摸地面禁用Java版飛行，但唔係喺贝德罗克版中。 進入礦車或床不能禁止飛行。"
    },
    {
      "id": "gamode_advn_section",
      "text": "冒險"
    },
    {
      "id": "gamode_advn_content",
      "text": "冒險模式係一種遊戲模式，用于玩家創建嘅地圖，限制我嘅世界中嘅一些遊戲。 在此模式下，玩家不能直接摧毀任何塊與任何工具或放置任何塊，以避免破壞冒險地圖或悲傷的服務器。 只能透過命令或遊戲模式選擇器訪問冒險模式。 冒險模式類似于生存，因為玩家受到環境嘅破壞，死亡係可能嘅，玩家必須打理飢餓。 然而，它喺好多方面都不同。 在Java版中，僅使用具有CanDestroy NBT標籤嘅項目/工具銷毀塊，並且唔可以畀玩家嘅拳頭銷毀。 同樣，塊需要放置CanPlaceOn NBT標記。 同樣，贝德罗克版中緊，can_destroy同can_place_on NBT標籤都需要銷毀和放置方塊。 然而，玩家能夠利用環境嘅其他方式-包括與生物同其他實體互動（例如，殺死佢哋），打開或關閉紅石機制（如槓桿），並與村民交易。 此外，玩家能夠像在任何其他遊戲模式下一樣製作物品。 另一個特點係，玩家成日完全喺世界產卵點上生成，無論它喺邊度-唔似生存模式，玩家可以喺特定網格內嘅任何地方生成。"
    },
    {
      "id": "gamemode_hrdc_section",
      "text": "鉄桿"
    },
    {
      "id": "gamemode_hrdc_content",
      "text": "鉄桿係生存嘅Java版獨家變體。 在此模式下，世界被鎖定為困難，玩家在被殺後無法重生。 Hardcore模式嘅關鍵功能係，玩家冇好似喺其他遊戲模式中噉喺死亡時選擇重生。 相反，死亡屏幕上有兩個按鈕：\"幽靈世界\"和\"標題屏幕\"。 徜徉幽靈世界徜徉把玩家設置到徜徉旁觀者桎梏模式，並喺世界嘅產卵啲重生玩家，要佢哋能夠僅以該模式查看和探索世界。 \"標題屏幕\"按鈕將播放器引導到主餐牌屏幕; 打開世界只係返回玩家回到相同嘅死亡屏幕番，因為以前。 此外，鉄桿模式世界僅限於困難。 創建鐵桿模式世界時，\"啟用作弊\"和\"獎金箱\"世界選項將鎖定為\"關閉\"。 在\"世界選擇\"餐牌上，鉄桿模式世界顯示深紅色文本，上面寫住\"鉄桿模式！"
    },
    {
      "id": "letsPlay",
      "text": "我哋嚟玩啦！"
    },
    {
      "id": "shop_title",
      "text": "是否要升級/購買排名？"
    },
    {
      "id": "shop_link",
      "text": "轉到此處"
    },
    {
      "id": "thx1",
      "text": "嗯 ... 沒有我，呢個礦船永遠唔會存在。 感謝您的支持"
    },
    {
      "id": "thx2",
      "text": "非常感謝T-XIvIN社區開發此網站。"
    },
    {
      "id": "thx_title",
      "text": "出價感謝"
    }
  ]
}
