{
  "Texts": [
    {
      "id": "title_ServerAdvantages",
      "text": "ข้อดีของ Minecraft Server ของเรา"
    },
    {
      "id": "adv_1",
      "text": "เซิร์ฟเวอร์ความเร็วสูง"
    },
    {
      "id": "adv_2",
      "text": "ความเป็นส่วนตัว"
    },
    {
      "id": "adv_3",
      "text": "ชุมชนที่ดีที่สุด"
    },
    {
      "id": "adv_4",
      "text": "โฮสต์ 24/7"
    },
    {
      "id": "gamemode_Title",
      "text": "โหมดเกม"
    },
    {
      "id": "gamemode_Subtitle",
      "text": "โหมดเกมที่มีอยู่ในเซิร์ฟเวอร์ minecraft ของเรา"
    },
    {
      "id": "gamode_surv_section",
      "text": "การอยู่รอด"
    },
    {
      "id": "gamemode_surv_content",
      "text": "โหมดเอาชีวิตรอดเป็นหนึ่งในโหมดเกมหลักในมายคราฟ ผู้เล่นจะต้องรวบรวมทรัพยากรสร้างโครงสร้างต่อสู้กับฝูงชนกินและสำรวจโลกด้วยความพยายามที่จะเติบโตและอยู่รอด ใน Bedrock Edition ผู้เล่นอาจได้รับความสำเร็จในโลกที่ไม่ได้ตั้งค่าเป็น Flat ในขณะที่เล่น Survival Mode โดยปิดกลโกงปิดโปรแกรมเสริมและปิดสิทธิ์ของโฮสต์ หากผู้เล่นสร้างโลกในโหมดสร้างสรรค์แล้วโหลดในโหมดเอาชีวิตรอดผู้เล่นจะไม่สามารถรับรางวัลพิเศษในโลกนั้นได้ ใน Minecraft Survival เป้าหมายหลักคือเอาชีวิตรอดสร้างสำรวจและสนุกสนาน แต่เป้าหมายเสริมใน Survival คือการเอาชนะ Ender Dragon และ Wither ใน Survival ผู้เล่นจะมีสินค้าคงคลังเพื่อรวบรวมไอเท็ม บล็อกทั้งหมดต้องใช้เวลาระยะหนึ่งในการทำลายซึ่งแตกต่างจากโหมดสร้างสรรค์ที่คุณสามารถทำลายบล็อกได้ทันที ไอเท็มเหล่านี้สามารถใช้ในสูตรอาหารเพื่อสร้างเครื่องมือต่างๆ ได้แก่ (Pickaxe, Axe, Sword, Hoe, Shovel) และไอเท็มอื่น ๆ นอกจากนี้ยังสามารถเข้าถึงสูตรอาหารได้ง่ายขึ้นโดยคลิกที่หนังสือสูตรอาหารที่มุมล่างซ้าย กระบวนการนี้เรียกว่างานหัตถกรรม สูตรการประดิษฐ์ส่วนใหญ่ต้องใช้โต๊ะคราฟต์ บางรายการไม่สามารถหาได้จากการประดิษฐ์ตามปกติและต้องใช้เตาเผาเพื่อแปรรูป มีสถานีการประดิษฐ์อื่น ๆ อีกมากมายสำหรับการใช้งานอื่น ๆ เช่นการต้มเบียร์การซ่อมแซมและการสร้างเสน่ห์ ในโหมดเอาชีวิตรอดผู้เล่นจะได้รับความเสียหายจากสภาพแวดล้อม (ความเสียหายจากการตกการหายใจไม่ออกและลาวา) และจากฝูงชนที่ไม่เป็นมิตร (เว้นแต่จะเล่นแบบสงบที่ซึ่งม็อบศัตรูจะถูกปิดใช้งาน) ผู้เล่นที่ได้รับความเสียหายเพียงพอจะตายและกลับไปที่จุดเกิด หากเปิดใช้กลโกงผู้เล่นสามารถเปลี่ยนเป็นโหมดเอาชีวิตรอดได้โดยใช้คำสั่ง / โหมดการอยู่รอด แต่ไม่สามารถรับรางวัลพิเศษได้"
    },
    {
      "id": "gamode_crtv_section",
      "text": "สร้างสรรค์"
    },
    {
      "id": "gamemode_crtv_content",
      "text": "โหมดสร้างสรรค์เป็นหนึ่งในโหมดเกมหลักใน Minecraft โหมดครีเอทีฟจะดึงแง่มุมการเอาชีวิตรอดของ Minecraft ออกไปและช่วยให้ผู้เล่นสามารถสร้างและทำลายโครงสร้างและกลไกได้อย่างง่ายดายด้วยการใช้บล็อกและการบินที่ไม่สิ้นสุด นอกจากนี้ยังเปลี่ยนเพลงพื้นหลัง ในโหมดสร้างสรรค์ผู้เล่นไม่มีพลังชีวิตหรือแถบความหิวที่จะขัดขวางการสร้างของพวกเขา (แม้ว่าจะยังกินได้และสุขภาพของผู้เล่นยังคงลดลงหากพวกเขาได้รับความเสียหายจากความว่างเปล่า) โหมดสร้างสรรค์ช่วยให้ผู้เล่นสามารถทำลายบล็อกทั้งหมดได้ทันที (รวมถึงบล็อกที่ทำลายไม่ได้ตามปกติเช่นฐานรากและเฟรมประตูท้าย) หากพวกเขาไม่ได้ถือดาบตรีศูลหรือไม้แก้จุดบกพร่อง อย่างไรก็ตามการบล็อกเหล่านี้จะไม่ตกหล่นและต้องได้รับจากคลังโฆษณา โหมดสร้างสรรค์ช่วยให้ผู้เล่นสามารถบินได้ ในการเปิดใช้งานการบินให้แตะสองครั้งที่ปุ่มกระโดด ใช้ปุ่มกระโดดเพื่อขึ้นและปุ่มแอบเพื่อลงและปุ่มการเคลื่อนไหวค่าเริ่มต้นคือ WASD เพื่อย้าย ผู้เล่นสามารถปิดการบินกลางอากาศได้โดยการกระโดดสองครั้งอีกครั้งทำให้พวกเขาตกลงสู่พื้น การสัมผัสพื้นเมื่อบินจะปิดใช้งานการบินใน Java Edition แต่ไม่ใช่ใน Bedrock Edition การเข้าไปในรถมินิคาร์ทหรือเตียงไม่ได้ปิดการบิน"
    },
    {
      "id": "gamode_advn_section",
      "text": "การผจญภัย"
    },
    {
      "id": "gamode_advn_content",
      "text": "โหมดผจญภัยเป็นโหมดเกมที่มีไว้สำหรับแผนที่ที่ผู้เล่นสร้างขึ้นโดย จำกัด การเล่นเกมบางส่วนใน Minecraft ในโหมดนี้ผู้เล่นไม่สามารถทำลายบล็อกด้วยเครื่องมือใด ๆ โดยตรงหรือวางบล็อกใด ๆ เพื่อหลีกเลี่ยงการทำลายแผนที่การผจญภัยหรือเซิร์ฟเวอร์ที่ทำให้เศร้าโศก โหมดผจญภัยสามารถเข้าถึงได้ด้วยคำสั่งหรือตัวเลือกโหมดเกมเท่านั้น โหมดผจญภัยคล้ายกับการอยู่รอดตรงที่ผู้เล่นได้รับความเสียหายจากสภาพแวดล้อมการตายเป็นไปได้และผู้เล่นต้องจัดการกับความหิว อย่างไรก็ตามมันก็แตกต่างกันในหลาย ๆ ด้านเช่นกัน ใน Java Edition บล็อกสามารถทำลายได้ด้วยไอเท็ม / เครื่องมือที่มีแท็ก CanDestroy NBT เท่านั้นและไม่สามารถทำลายได้ด้วยกำปั้นของผู้เล่น ในทำนองเดียวกันบล็อกต้องใช้แท็ก CanPlaceOn NBT เพื่อวาง ใน Bedrock Edition ในทำนองเดียวกันแท็ก can_destroy และ can_place_on NBT เพื่อทำลายและวางบล็อก อย่างไรก็ตามผู้เล่นสามารถใช้ประโยชน์จากสภาพแวดล้อมในรูปแบบอื่น ๆ ได้เช่นการโต้ตอบกับฝูงชนและหน่วยงานอื่น ๆ (เช่นการฆ่าพวกมัน) การเปิดหรือปิดกลไกจับกลุ่ม (เช่นคันโยก) และการซื้อขายกับชาวบ้าน นอกจากนี้ผู้เล่นยังสามารถสร้างไอเท็มได้ตามปกติในโหมดเกมอื่น ๆ คุณสมบัติอีกประการหนึ่งคือผู้เล่นมักจะวางไข่ที่จุดวางไข่ของโลกไม่ว่าจะอยู่ที่ไหน - ต่างจากโหมดเอาชีวิตรอดที่ผู้เล่นสามารถวางไข่ได้ทุกที่ภายในตาราง"
    },
    {
      "id": "gamemode_hrdc_section",
      "text": "ฮาร์ดคอร์"
    },
    {
      "id": "gamemode_hrdc_content",
      "text": "Hardcore เป็นรูปแบบการเอาชีวิตรอดที่เป็นเอกสิทธิ์เฉพาะของ Java Edition ในโหมดนี้โลกถูกล็อคให้อยู่ในระดับความยากและผู้เล่นจะไม่สามารถเกิดใหม่ได้หลังจากถูกฆ่า คุณสมบัติที่สำคัญของโหมด Hardcore คือผู้เล่นไม่ได้รับตัวเลือกในการเกิดใหม่เมื่อตายเหมือนอย่างที่ทำในโหมดเกมอื่น ๆ แต่จะมีปุ่มสองปุ่มบนหน้าจอมรณะแทน: \"โลกแห่งการมองเห็น\" และ \"หน้าจอชื่อเรื่อง\" \"โลกแห่งการมองเห็น\" ตั้งค่าผู้เล่นเป็นโหมดผู้ชมและทำให้ผู้เล่นเกิดใหม่ ณ จุดเกิดของโลกทำให้พวกเขาสามารถดูและสำรวจโลกได้เฉพาะในโหมดนั้น ปุ่ม \"Title screen\" จะนำผู้เล่นไปที่หน้าจอเมนูหลัก การเปิดโลกใหม่เพียงแค่ทำให้ผู้เล่นกลับไปสู่หน้าจอมรณะเหมือนเดิม นอกจากนี้โลกของโหมด Hardcore ยังถูก จำกัด ให้อยู่ในระดับยาก เมื่อสร้างโลกในโหมดฮาร์ดคอร์ตัวเลือกเปิดใช้กลโกงและหีบโบนัสจะถูกล็อกเป็นปิด ในเมนูการเลือกโลกโลกของโหมดฮาร์ดคอร์จะแสดงข้อความสีแดงเข้มว่า \"โหมดไม่ยอมใครง่ายๆ!\""
    },
    {
      "id": "letsPlay",
      "text": "มาเล่นกัน!"
    },
    {
      "id": "shop_title",
      "text": "คุณต้องการอัพเกรด / ซื้ออันดับหรือไม่?"
    },
    {
      "id": "shop_link",
      "text": "มานี่"
    },
    {
      "id": "thx1",
      "text": "อืม ...... ถ้าไม่มีฉัน minecraft นี้ไม่เคยมีอยู่จริง ขอบคุณสำหรับการสนับสนุน"
    },
    {
      "id": "thx2",
      "text": "ขอบคุณมากสำหรับชุมชน T-XIvIN สำหรับการพัฒนาไซต์นี้"
    },
    {
      "id": "thx_title",
      "text": "ขอบคุณมากสำหรับ"
    }
  ]
}
